<template>
  <base-page :navOptions="navOptions">
    <better-scroll class="mainBody">
      <div class="order">
        <div class="title-div">
          <div class="line"></div>
          <div class="title">借款协议</div>
          <div class="line"></div>
        </div>
        <div>
          <create-order-cell title="借款金额" :text="`${repayCalutate.applyGross}元`"/>
          <create-order-cell title="借款天数" :text="`${repayCalutate.applyTerm}天`"/>
          <create-order-cell title="综合服务费" :text="`${repayCalutate.serviceFee}元`"/>
          <create-order-cell title="利息费用" :text="`${repayCalutate.applyTerm}元`"/>
          <create-order-cell title="借款申请费用" :text="`${repayCalutate.totalApplyFee}元`"/>
          <!--<create-order-cell title="还款方式" :text="`一次性还${totalFee}元`"/>-->
          <create-order-cell title="还款日期" :text="repayTime"/>
        </div>
        <div></div>
        <div class="repayBtns">
          <div class="create_order_checkbox">
            <cube-checkbox v-model="isAgree">
              我已经阅读并同意
            </cube-checkbox>
            <span @click="openDialogClick" class="pact">《条款合同》</span>
          </div>
          <button class="ra-Btn signBtn" @click="createOrderClick">立即签约</button>
        </div>
      </div>
    </better-scroll>
    <r-dialog ref="dialog" title="协议合同">
      <better-scroll :scrollbar="{fade: false}">
        借款协议

        合同编号：I2ZOAMUHBU4E

        签订日期：2019-03-20

        甲方（出借人）：火火贷


        乙方（借款人）：孙美洪


        身份证号：330719196804253671
        手机号码：17157721142
        银行卡号：6221888200604489572




        “火火贷”微信公众号及APP（以下简称“本产品”）由网络科技有限公司负责运营，为乙方提供借贷咨询、居间、账户管理等服务。乙方已在平台注册，并承诺其提供给平台的信息是完全真实有效的。甲方承诺对本协议涉及的借款具有完全的支配能力，为其合法所得。乙方有借款需求，并通过平台提交借款申请，甲方亦同意借款，甲乙双方有意接受通过火火贷平台的服务，成立借贷关系。
        各方经协商一致，于2019-03-20（借款日期）通过火火贷平台以电子文本的形式达成协议如下，协议各方已对本协议各条款内容作了充分理解，特别是加粗字体部分：

        定义


        除非上下文另行要求, 本合同中的下列词语和用语含义如下:
        1.本金，指甲方出借给乙方的金额。
        2.利息，指基于本金产生的相关收益，含正常借款期内利息、容时期利息、逾期利息。
        3.容时期，指借款期满后7天内，容时期会产生容时期利息及其他费用。
        4.逾期，指容时期满后的状态，逾期会产生逾期利息及其他费用。
        5.还款，指乙方偿还借款本息及/或支付快速信审费、账户管理费的行为。

        第一条 借款基本信息

        借款日期：2019-03-20

        借款本金：1000元

        实际到账：709元

        借款期限：7天

        正常借款期内，

        利息：11.00元

        账户管理费：140.00元

        快速审核服务费：140.00元

        还款日期：2019-03-27，当天一次性还清

        还款金额：1000元。双方协商一致，乙方向甲方偿还的本息。

        第二条 借款发放方式

        甲乙双方确认，甲方通过个人网银或第三方支付渠道将款项转入乙方在平台注册帐号绑定的银行卡账户。款项一经从甲方的银行账户或第三方支付账户转出或支付，即视为资金已经发放，乙方不得以任何理由拒绝履行本协议项下的还款义务。


        若乙方收到的借款金额与本协议约定不一致的，协议各方同意按照以下方式处理：
        1）实际收到金额小于本协议约定借款金额的，任何一方应在3天内通过平台或电话通知其他方，由甲方安排1日内补齐差额至乙方绑定银行卡，借款期限自补齐时起算。否则，本合同借款金额按照实际支付金额计算（其中正常借款期内，利息按照乙方实际收到金额计收，快速信审费及账户管理费仍按照第一条约定金额收取；乙方容时或逾期还款的，容时期及逾期期间，利息及账户管理费按照乙方实际收到金额计收）。
        2）实际收到金额大于本协议约定借款金额的，任何一方应在3天内通过平台或电话通知其他方，乙方应在1日内退还多余金额。否则本合同借款自始金额按照实际支付金额计算（其中正常借款期内，利息按照乙方实际收到金额计收，快速信审费及账户管理费仍按照第一条约定金额收取；乙方容时或逾期还款的，容时期及逾期期间，利息及账户管理费按照乙方实际收到金额计收）。

        第三条 容时还款

        如因乙方原因，乙方在本协议的还款日无法按时还款，甲方同意乙方容时还款，容时还款最长期限为7天，同时乙方承诺向甲方支付容时期利息，以及账户管理费。容时期利息和容时期账户管理费统称为“容时期费用”

        容时期利息总额 = 借款金额×对应容时期利息利率(0.04%)×容时天数。

        容时期账户管理费总额 = 借款金额×对应容时期账户管理费率(0.96%)×容时天数。

        容时期是甲方给予乙方还款的宽限期，如超过还款最长容时期限后，乙方仍无法偿还应还款总额及容时费用总额，则视为乙方逾期还款，应当按照本协议的约定承担违约责任。

        第四条 各方权利和义务

        甲方的权利和义务

        甲方应在本协议签订日期通过本协议第二条中规定的借款发放方式，将足额的借款本金支付给乙方。甲方保证其所用于出借的资金来源合法，甲方是该资金的合法所有人，如果第三人对资金归属、合法性问题发生争议，由甲方负责解决。甲方享有其出借款项所带来的利息收益。如乙方违约，甲方有权根据自己的意愿进行本协议下其对乙方债权的转让。在甲方的债权转让后，乙方需对债权受让人继续履行本协议下其对甲方的还款义务。甲方应确保其提供信息和资料的真实性，不得提供虚假信息或隐瞒重要事实。甲方授权第三方管理其在本协议项下对乙方的债权，管理权限包括代为收取本金、利息，代为接受乙方的续期申请，代为向乙方催收。

        乙方权利和义务

        乙方必须按本协议第一条中的规定，在还款日一次性足额支付本金、利息、账户管理费，快速信审费，如无法在还款日按时还款，还款自动进入7天容时期，乙方除支付上述费用外，还须分别向甲方支付本协议第三条中规定的容时期利息和容时期账户管理费。乙方承诺所借款项不用于任何违法用途, 否则由乙方自行承担全部责任。乙方应确保其提供的信息和资料的真实性，不得提供虚假信息或隐瞒重要事实。乙方不得将本协议项下的任何权利义务转让给其他任何第三方。乙方清楚并同意甲方在本协议项下债权的管理人，乙方授权甲方在借款的还款日通过甲方提供的第三方支付方式从乙方绑定的银行账户内划转应还款金额，并协助甲方获得第三方划扣所需的文件及授权。乙方在此无条件且不可撤销地授权：如乙方发生逾期还款行为，甲方即有权与乙方运营商详单中的电话或者短信联系人取得联系，告知乙方联系人本借款合同的内容并请求乙方联系人向乙方转达违约提醒，甲方与乙方联系人的联系方式包括但不限于电话、短信、电子邮件和上门等。乙方知悉并同意，甲方向乙方联系人公布乙方的逾期情况是由于乙方的违约行为，该等分享或公开并不侵犯或损害到乙方的隐私权利。乙方充分知悉并同意，甲方为乙方提供本产品/服务的前提是乙方同意甲方将乙方的逾期还款等违约情形予以公开并就还款事项联系乙方联系人。若乙方不同意将其违约情况予以公开/就还款事项联系乙方联系人，则本业务缺乏开展的前提，甲方有权不提供本产品/服务。基于行业特性和甲方向乙方提供服务的特殊方式，若甲方公开乙方的违约情形对乙方造成任何的困扰、损害等，乙方放弃该等隐私权利的救济。乙方同意本协议第九条委托代扣款授权的相关内容。

        第四条 违约责任

        合同各方均应严格履行合同义务，非经各方协商一致或依照本协议约定，任何一方不得解除本协议。任何一方违约，违约方应承担因违约使得其他各方产生的费用和损失，包括但不限于调查费、诉讼费、律师费等，应由违约方承担。如违约方为乙方的，甲方有权立即解除本协议，并要求乙方立即偿还未偿还的本金、利息等其他费用。此时，乙方还应向甲方支付所有应付的账户管理费、快速信审费、容时期账户管理费（如有）、逾期管理费（如有）和违约引发的其他费用。乙方应按照如下顺序清偿款项：

        1）根据本协议产生的其他全部费用。

        2）本协议第一条约定的逾期账户管理费。

        3）本协议第一条约定的逾期利息。

        4）本协议第三条第约定的容时期账户管理费。

        5）本协议第三条第约定的容时期利息。

        6）快速信审费。

        7）正常的账户管理费。

        8）正常的利息。

        9）正常的本金。

        乙方应严格履行还款义务，如乙方逾期还款，则应按照下述条款向甲方支付逾期利息。

        逾期利息总额 = 借款金额×对应逾期利息利率(0.05%)×逾期天数。

        乙方应严格履行还款义务，如乙方逾期还款，则应按照下述条款向甲方支付逾期账户管理费。

        逾期管理费总额 = 借款金额×对应逾期管理费率(1.95%)×逾期天数。

        如果乙方逾期，或甲方发现乙方出现逃避、拒绝沟通或拒绝承认欠款事实、故意转让资金、信用情况恶化等影响本协议履行的情形，甲方有权将乙方的“逾期记录”、“恶意行为”或“不良情况”记入公民征信系统，或将乙方违约失信的相关信息及乙方其他信息向其亲属朋友、媒体、用人单位、公安机关、检查机关、法律机关披露，甲方不承担任何法律责任。当乙方逾期还款时，在乙方还清全部本金、正常利息、账户管理费、快速信审费、容时期利息、容时期账户管理费、逾期利息、逾期账户管理费之前，逾期利息及逾期账户管理费的计算不停止。

        第五条 征信授权

        乙方知晓并同意甲方依据《征信业管理条例》及相关法律法规，委托第三方征信机构，合法调查乙方信息，包括但不限于个人基本信息、借贷交易信息、银行卡交易信息、电商交易信息、公用事业信息、央行征信报告。所获取的信息，仅在此笔借贷业务的居间服务和贷后管理工作中使用。甲方将对所获取的信息妥善进行保管，除为乙方提供信审服务/借款资金的合作方外，未经乙方授权，不得向其他机构或个人公开、编辑或透露信息内容。乙方知晓并同意甲方依据《征信业管理条例》及相关法律法规，向第三方征信机构提交乙方在此笔借贷业务中产生的相关信息，包括但不限于个人基本信息、借款申请信息、借款合同信息以及还款行为信息，并记录在征信机构的个人信用信息数据库中。乙方同意若乙方未按时履行还款义务，甲方按合同所留联系方式对乙方进行提醒并告知，乙方若仍未履行还款义务，甲方可将乙方的逾期还款信息提交至第三方征信机构，记录在征信机构的个人信用信息库中。乙方知晓并同意，乙方已被明确告知未按时还款信息一旦记录在第三方征信机构的个人信用信息数据库中，在日后的经济活动中对乙方可能产生的不良影响。乙方知晓第三方征信机构包括但不限于：北京华道征信有限公司、北京安融惠众征信有限公司、上海资信有限公司和鹏元资信评估有限公司。乙方保证其所提供的个人信息均为乙方本人的真实信息，不可为他人的信息或虚假信息，若涉嫌恶意信息作假或盗用他人信息，将可能记入网络征信系统，影响乙方的征信记录，同时甲方将保留追究乙方相应法律责任的权利。如乙方所提供的个人信息中的全部或部分信息为他人信息或虚假信息，甲方将有权暂停或终止与乙方的全部或部分服务协议，由此行为所产生的全部法律责任将由乙方承担，甲方将不对此承担法律责任。

        第六条 提前还款

        乙方提前还款的，需还款金额与到期日应还款金额一致。

        第七条 法律及争议解决

        本协议的签订、履行、终止、解释均适用中华人民共和国法律，并由甲方所在地的人民法院管辖。

        第八条 委托代扣款授权

        授权账户信息

        开户名：孙美洪

        身份证号：330719196804253671

        持卡人手机号：17157721142


        银行卡号：6221888200604489572
        乙方保证以上“授权账户信息”中的身份及所提供的信息真实、有效、准确及合法，因乙方身份或所提供信息错误而引起的法律后果及损失，由乙方自行承担。乙方同意甲方通过第三方支付公司代扣支付平台，从乙方的银行账户中将还款金额一次性全部划拨到甲方在第三方支付公司的专用账户；若因乙方银行账户中的可扣取金额不足以支付全部还款金额从而导致扣款失败的，乙方同意甲方通过降低扣取数额的方式多次尝试扣款，将乙方银行账户内的可扣取金额全部拨划至甲方在第三方支付公司的专用账户，直至本协议项下的借款全部偿还完毕为止。扣款成功后，对代扣金额中甲方应得的本金、利息及其他费用，甲方按照甲方的要求支付给甲方，乙方对此表示认可。乙方应当按照预付款的金额在上述银行卡内存入足够的款项，甲方工作人员根据乙方预付款金额办理相关扣款转账手续；由于挂失、账户冻结、金额不足等原因造成扣款失败而导致乙方损失的，由乙方自行承担。若乙方申请对本协议项下的借款进行续期的，则乙方应当在上述银行卡内存入足够的款项，甲方工作人员根据乙方续期所需交纳的款项（包括但不限于利息、快速信审费、账户管理费、续期手续费等）办理相关扣款转账手续；由于挂失、账户冻结、金额不足等原因造成扣款失败而导致乙方续期未成功或造成乙方其他损失的，由乙方自行承担。乙方变更付款授权账户时，须及时通知甲方，并在平台进行变更账号绑定。因乙方未及时办理变更手续而导致的结果，由乙方承担。本项授权自签订日起开始生效，有效期至本协议项下借款本息、费用清偿之日止。

        第九条 附则

        本协议采用电子文本形式制成，并保存在甲方为此设立的专用服务器上备查，各方均认可该形式的协议效力。本协议自文本签订生成之日生效。经甲方、乙方协商一致后，各方可对本协议进行变更或补充，并另行签署补充协议。经甲方同意后，乙方可申请对本协议项下的借款进行续期，具体约定以三方另行签署的《借款续期协议》为准。本协议签订之日起至借款全部清偿之日止，乙方或甲方有义务在下列信息变更三日内提供更新后的信息给甲方：手机号码、身份证号码、亲属联系人及社会联系人姓名、职业、银行账户的变更。若因任何一方不及时提供上述变更信息而带来的损失或额外费用应由该方承担。如果本协议中的任何一条或多条违反适用的法律法规，则该条将被视为无效，但该无效条款并不影响本协议其他条款的效力。本协议各条目标题仅为方便各方阅读使用，具体意思以条文内容约定为准。
      </better-scroll>
    </r-dialog>
  </base-page>
</template>

<script>
import { baseMixin } from 'js/mixins'
import { url } from 'js/const'
import { request } from 'js/utils'
import CreateOrderCell from './components/CreateOrderCell'
import moment from 'moment'
export default {
  name: 'LoanBargain',
  mixins: [baseMixin],
  data () {
    return {
      navOptions: {
        title: '签约订单',
        isBack: true
      },
      isAgree: false,
      repayCalutate: {
        agreedRepayGross: 0,
        applyGross: 0,
        applyTerm: 0,
        interestFee: 0,
        loanGross: 0,
        serviceFee: 0,
        totalApplyFee: 0
      }
    }
  },
  computed: {
    totalFee () {
      return this.repayCalutate.applyGross + this.repayCalutate.serviceFee
    },
    repayTime () {
      let time = moment().add(7, 'days').format('YYYY-MM-DD h:mm')
      console.log(time)
      return time
    }
  },
  mounted () {
    this.getRepayCalculate()
  },
  methods: {
    sendNotification () {
      this.bus.$emit('myOrdersRefresh')
    },
    openDialogClick () {
      this.$refs.dialog.open()
    },
    // 获取借款
    getRepayCalculate () {
      const routeParams = this.$route.query
      request({
        type: 'post',
        path: url.LoanCalculate,
        data: routeParams,
        fn: data => {
          this.repayCalutate = data.result
          console.log(data.result)
        }
      })
    },
    // 创建订单
    createOrderClick () {
      const routeParams = this.$route.query
      if (!this.isAgree) {
        this.errorT('请仔细阅读并同意条款合同')
      } else {
        this.loadingT()
        request({
          type: 'post',
          path: url.CreateOrder,
          data: routeParams,
          fn: data => {
            this.hideT()
            this.successT('签约成功')
            this.sendNotification()
            let result = data.result
            if (result.statusName === '待认证') {
              this.$router.replace({ name: 'verify' })
            } else {
              this.$router.replace({ name: 'my-orders' })
            }
          },
          errFn: () => {
            this.hideT()
          }
        })
      }
    }
  },
  watch: {
    isAgree (newVlaue) {
      if (newVlaue) {
        this.$refs.dialog.open()
      }
    }
  },
  components: {
    CreateOrderCell
  }
}
</script>

<style lang="less" scoped>
@import "~less/variable";
@import "~less/mixin";
.container{
  background: @light_gray;
  .order{
    .title-div{
      padding: 20px 0;
      .display-flex();
      .flex-justify-content-center();
      .flex-align-items-center();
      .title{
        font-size: @font_size_3;
        margin: 0 10px;
      }
      .line{
        height: 1px;
        width: 80px;
        background: @light_gray2;
      }
    }
    .repayBtns{
      .signBtn{
        display: block;
        margin: 10px auto 40px auto;
      }
      .create_order_checkbox{
        padding: 20px @space1 0 @space1;
        height: 20px;
        line-height: 20px;
        font-size: @font_size_2;
        .display-flex();
        .flex-align-items-center();
      }
      .pact{
        color: @theme_color2;
        text-decoration:underline
      }
    }
  }
}
</style>
